[
  {
    "title": "Machine Learning Intern",
    "subtitle": "Alexandria University ",
    "date": "Aug 2023 - Sep 2023",
    "description": [
      "Developed an assistive Android application integrating real-time object detection with Google's Text-to-Speech API to provide auditory descriptions of a user's surroundings.",
      "Gained proficiency in the full Android development lifecycle using Android Studio, from prototyping and coding to testing on emulators and debugging performance issues.",
      "Successfully merged machine learning capabilities with core mobile app features, demonstrating skills in AI integration and creating accessible technology solutions."
    ],
    "technologies": ["Android Studio", "Debugging", "Google APIs"]
  },
  {
    "title": "Graduation Project",
    "subtitle": "Alexandria University",
    "date": "Sep 2023 - Jul 2024",
    "description": [
      "Led full-stack development of a Hotel Reservation System as a graduation capstone project.",
      "Designed an admin dashboard for managing rooms, users, bookings, and viewing system analytics.",
      "Created a customer-facing UI for browsing, filtering, and booking rooms with confirmation workflows.",
      "Showcased proficiency in UI/UX design, API development, database management, and cross-platform deployment."
    ],
    "technologies": ["React", "JavaScript", "CSS3", "HTML3", "Tailwind CSS", "Agile Methodology"]
  },
  {
    "title": "Bachelor of Computer and Systems Engineering",
    "subtitle": "Alexandria University",
    "date": "Sep 2019 - Jun 2024",
    "description": [
      "Coursework: Data Structures & Algorithms, Database Systems, Web Technologies, Software Engineering",
      "Final Year Project: Developed a machine learning-based recommendation system for e-learning platforms",
      "OC member of the Universty ACM student chapter , organized hackathons and tech workshops"
    ],
    "technologies": ["C", "Java", "SQL", "Python", "Algorithms", "Data Structures", "c++", "OOP", "Software Development",  "Team Collaboration"]
  }
]